Revit 2024 API
MEPNetworkSegmentData Constructor (MEPNetworkSegmentData)
 Creates a new segment data object based on another object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public MEPNetworkSegmentData(
	MEPNetworkSegmentData other
)
Visual Basic
Public Sub New ( _
	other As MEPNetworkSegmentData _
)
Visual C++
public:
MEPNetworkSegmentData(
	MEPNetworkSegmentData^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData
 The other segment data that the new object is based on.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPNetworkSegmentData Class
MEPNetworkSegmentData Overload
Autodesk.Revit.DB.Analysis Namespace